In [10]:
import pandas as pd

df = pd.read_csv('data/enrollment2.csv')

In [11]:
df

           id  year           course name   status
0     2777729     1               science  allowed
1     2777730     2               science  allowed
2     2777765     1                  arts  allowed
3     2777766     2                  arts  allowed
4     2777785     1                   mba  allowed
...       ...   ...                   ...      ...
1995  2796805     3  computer application  allowed
1996  2796812     1               nursing  allowed
1997  2796813     2               nursing  allowed
1998  2796814     3               nursing  allowed
1999  2796815     4               nursing  allowed

[2000 rows x 4 columns]

         id  year    course name       status
0   2777729     1        science      allowed
1   2777730     2        science      allowed
2   2777765     1           arts      allowed
3   2777766     2           arts      allowed
4   2777785     1            mba      allowed
5   2777786     2            mba      allowed
6   2777793     1  mba 2nd shift  not allowed
7   2777794     2  mba 2nd shift  not allowed
8   2777795     1  mca 2nd shift  not allowed
9   2777796     2  mca 2nd shift  not allowed
10  2777797     3  mca 2nd shift  not allowed
11  2777798     1           bjmc  not allowed
12  2777799     2           bjmc  not allowed
13  2777800     3           bjmc  not allowed
14  2777814     1        history      allowed
15  2777815     2        history      allowed
16  2777837     4      chemistry      allowed
17  2777858     4         botany      allowed
18  2604364     1        history      allowed
19  2604408     3        finance      allowed

In [13]:
df.loc[df['status']=='not allowed','room assignment']='not assigned'
df.head(20)

         id  year    course name       status room assignment
0   2777729     1        science      allowed             NaN
1   2777730     2        science      allowed             NaN
2   2777765     1           arts      allowed             NaN
3   2777766     2           arts      allowed             NaN
4   2777785     1            mba      allowed             NaN
5   2777786     2            mba      allowed             NaN
6   2777793     1  mba 2nd shift  not allowed    not assigned
7   2777794     2  mba 2nd shift  not allowed    not assigned
8   2777795     1  mca 2nd shift  not allowed    not assigned
9   2777796     2  mca 2nd shift  not allowed    not assigned
10  2777797     3  mca 2nd shift  not allowed    not assigned
11  2777798     1           bjmc  not allowed    not assigned
12  2777799     2           bjmc  not allowed    not assigned
13  2777800     3           bjmc  not allowed    not assigned
14  2777814     1        history      allowed             NaN
15  2777815     2        history      allowed             NaN
16  2777837     4      chemistry      allowed             NaN
17  2777858     4         botany      allowed             NaN
18  2604364     1        history      allowed             NaN
19  2604408     3        finance      allowed             NaN

In [46]:
count = df.loc[df['status']!='not allowed','course name'].value_counts()
# count = df[(df['status']!='not allowed'),'course name'].value_counts()
# count = df['course name'].value_counts()
count

0       True
1       True
2       True
3       True
4       True
        ...
1995    True
1996    True
1997    True
1998    True
1999    True
Name: status, Length: 2000, dtype: bool

In [50]:
valid = df['status']=='allowed'
valid

0       True
1       True
2       True
3       True
4       True
        ...
1995    True
1996    True
1997    True
1998    True
1999    True
Name: status, Length: 2000, dtype: bool

In [51]:

small = (count>=5) & (count<15)
small = small[small]
small = list(small.index)

med = (count<40) & (count>=15)
med = med[med]
med = list(med.index)

large = (count>=40) & (count<80)
large = large[large]
large = list(large.index)

aud = (count>=80)
aud = aud[aud]
aud = list(aud.index)

for val in small:
    df.loc[(df['course name']==val)&valid,'room assignment']='Small room'
for val in med:
    df.loc[(df['course name']==val)&valid,'room assignment']='Medium room'
for val in large:
    df.loc[(df['course name']==val)&valid,'room assignment']='Large room'
for val in aud:
    df.loc[(df['course name']==val)&valid,'room assignment']='Auditorium'

In [38]:
df

           id  year           course name   status room assignment
0     2777729     1               science  allowed      Auditorium
1     2777730     2               science  allowed      Auditorium
2     2777765     1                  arts  allowed      Auditorium
3     2777766     2                  arts  allowed      Auditorium
4     2777785     1                   mba  allowed      Small room
...       ...   ...                   ...      ...             ...
1995  2796805     3  computer application  allowed     Medium room
1996  2796812     1               nursing  allowed     Medium room
1997  2796813     2               nursing  allowed     Medium room
1998  2796814     3               nursing  allowed     Medium room
1999  2796815     4               nursing  allowed     Medium room

[2000 rows x 5 columns]

In [45]:
new =df.loc[df['status']=='not allowed']
new

           id  year     course name       status room assignment
6     2777793     1   mba 2nd shift  not allowed    not assigned
7     2777794     2   mba 2nd shift  not allowed    not assigned
8     2777795     1   mca 2nd shift  not allowed    not assigned
9     2777796     2   mca 2nd shift  not allowed    not assigned
10    2777797     3   mca 2nd shift  not allowed    not assigned
...       ...   ...             ...          ...             ...
1979  2796773     2     music vocal  not allowed    not assigned
1980  2796774     3     music vocal  not allowed    not assigned
1984  2796786     1  computers (ug)  not allowed    not assigned
1985  2796787     2  computers (ug)  not allowed    not assigned
1986  2796788     3  computers (ug)  not allowed    not assigned

[552 rows x 5 columns]